Clean_184_01/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -0.62 0)
    (18.4 -0.62 0)
    (18.4 0.15 0)
    (0 0.15 0)
    (0 -0.62 0.1)
    (18.4 -0.62 0.1)
    (18.4 0.15 0.1)
    (0 0.15 0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (184 77 1) simpleGrading (1 0.1 1)

);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (5 6 2 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (4 0 1 5)
        );
    }
    atmosphere
    {
        type wall;
        faces
        (
            (7 3 2 6)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
