Clean_184_01/0/T.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 72.95;

boundaryField
{
    leftWall
    {
        type zeroGradient;
    }
    rightWall
    {
        type zeroGradient;
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform 5;
    }
    atmosphere
    {
        type            fixedValue;
        value           uniform 72.95;
    }
}

// ************************************************************************* //
